src/DataProcessors/ОбработкиНалоговИОтчетности/ОбработкиНалоговИОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкиНалоговИОтчетности</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеКалендаря</name>
    <type>
      <types>CatalogRef.КалендарьПодготовкиОтчетности</types>
      <types>CatalogRef.КалендарьПерсональныхЗадачОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСобытия</name>
    <type>
      <types>EnumRef.СостоянияСобытийКалендаря</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Enums/ВидыНалогов/ВидыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНалогов</name>
  <enumValues>
    <name>Госпошлина_ГосрегистрацияОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_ВредныеУсловия</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_ЛетныеЭкипажи</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_ТяжелыеУсловия</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_Шахтеры</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ВнутригородскойОкруг</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородскоеПоселение</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородскойОкруг</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородФедеральногоЗначения</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_МежселеннаяТерритория</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_СельскоеПоселение</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_МуниципальныйОкруг</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмуществоЕСГС</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_РегиональныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_ФедеральныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрофессиональныйДоход</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДС_ВвозимыеТовары</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ДоходыСвышеПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП_НалоговаяБазаСвышеПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ВнутригородскойРайон</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ГородскойОкруг</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ГородскойОкругСВнутригородскимДелением</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ГородФедеральногоЗначения</name>
  </enumValues>
  <enumValues>
    <name>ПСН_МуниципальныйРайон</name>
  </enumValues>
  <enumValues>
    <name>ПСН_МуниципальныйОкруг</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ПФР_Добровольные</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ПФР_НакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ПФР_СтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ФСС</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ФСС_НСиПЗ</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>УСН_Доходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_ДоходыМинусРасходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_МинимальныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ПФР_НакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ПФР_СтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>АУСН</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалоговыйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ПФР_Добровольные</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_СвышеПредела</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_Дивиденды_ДоходыСвышеПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ОПС_ИностранныеРаботники</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ОМС_ИностранныеРаботники</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ОСС_ИностранныеРаботники</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КалендарьПодготовкиОтчетности/КалендарьПодготовкиОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КалендарьПодготовкиОтчетности</name>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиКалендаряПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИнформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОбработкиСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляООО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПеренесенногоОкончанияСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСобытияДляПострадавших</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ОбработкиНалоговИОтчетности/ManagerModule.bsl
Процедура УточнитьСрокУплатыВзносовЕдиныйТариф(СрокУплаты) Экспорт
	
	Если Не ЗначениеЗаполнено(СрокУплаты) Тогда
		Возврат;
	КонецЕсли;  
	
	СрокУплаты = СрокУплатыНалогаВБюджет(Год(СрокУплаты), 12, 31);
	
КонецПроцедуры         

Процедура УточнитьСрокУплатыВзносовСвышеПредела(СрокУплаты) Экспорт
	
	Если Не ЗначениеЗаполнено(СрокУплаты) Тогда
		Возврат;
	КонецЕсли;
	
	Если КонецМесяца(СрокУплаты) = КонецГода(СрокУплаты)
		Или КонецМесяца(СрокУплаты) = КонецКвартала(СрокУплаты) Тогда
		СрокУплаты = СрокУплатыНалогаВБюджет(Год(СрокУплаты) + 1, 7, 1);
	КонецЕсли;
	
КонецПроцедуры

Функция СрокУплатыНалогаВБюджет(ГодУплаты, МесяцУплаты, ДеньУплаты) Экспорт
	
	ДатаУплатыНалога = Дата(ГодУплаты, МесяцУплаты, ДеньУплаты);
		
	// Перенесем на рабочие дни
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
		
	Если Не ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
		Возврат КонецДня(ДатаУплатыНалога);
	КонецЕсли; 
		
	ИсходныеДаты = Новый Массив;
	ИсходныеДаты.Добавить(ДатаУплатыНалога);
		
	ГрафикПереноса = КалендарныеГрафики.ДатыБлижайшихРабочихДней(
		ПроизводственныйКалендарь, 
		ИсходныеДаты,
		Ложь,
		Ложь,
		Истина);
	
	ДатаПереноса = ?(ЗначениеЗаполнено(ГрафикПереноса[ДатаУплатыНалога]), 
		ГрафикПереноса[ДатаУплатыНалога], ДатаУплатыНалога);
	
	Возврат КонецДня(ДатаПереноса);
	
КонецФункции

Функция ПолучитьСобытиеКалендаряПоВносамИПДоходы(Период, ВзносСДоходов = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КалендарьПодготовкиОтчетности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
		|ГДЕ
		|	КалендарьПодготовкиОтчетности.Задача = &Задача
		|	И КалендарьПодготовкиОтчетности.ДатаОкончанияСобытия > &ДатаОкончанияСобытия
		|	И КалендарьПодготовкиОтчетности.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаОкончанияСобытия", КонецГода(Период));
	
	Если ВзносСДоходов Тогда
		Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР;
	Иначе
		Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП;
	КонецЕсли;  	
		
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.КалендарьПодготовкиОтчетности.ПустаяСсылка();
	
КонецФункции    

Функция СозданныеДокументыОтраженияНаЕНС(Организация, Период, ВзносСДоходов = Ложь, ЗаписьКалендаря) Экспорт
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности"));
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ОперацияПоЕдиномуНалоговомуСчету"));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Уведомление", Новый ОписаниеТипов(ТипыДокументов));
	Результат.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Результат.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	// При упрощенном порядке показываем справочно в переходном периоде заявления, которые были созданы ранее в налоговом периоде
	УпрощенныйЗачетВзносов = РегламентированнаяОтчетностьУСН.УпрощенныйЗачетФиксированныхВзносов(Организация, Период);
	
	Если УпрощенныйЗачетВзносов Тогда
		
		Если ВзносСДоходов Тогда   
			ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_СвышеПредела;
		Иначе
			ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф;
		КонецЕсли; 	
		
		Если ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_СвышеПредела Тогда
			НалоговыйПериод = НачалоГода(НачалоГода(Период) - 1);
		Иначе
			НалоговыйПериод = НачалоГода(Период);
		КонецЕсли;
		
		ЗачтенныеРанееСуммыВзносов = ЕдиныйНалоговыйСчет.ЗачтенныеУплатыНалоговПоДокументамЗаПериод(
		Организация,
		НалоговыйПериод,
		Период,
		ВидНалога);
		ЗачтенныеРанееСуммыВзносов.Свернуть("Уведомление, Дата, Сумма");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЗачтенныеРанееСуммыВзносов, Результат);
	КонецЕсли;
	
	ПериодСобытия = НачалоДня(Период);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
	ЕдиныйНалоговыйСчет.ДанныеДляУведомлений(ЗаписьКалендаря, Организация, ПериодСобытия),
	Результат);  
	
	Возврат Результат;
	
КонецФункции
